


[
  {
    "id": 1,
    "img": "/ApiImage/Aimg1.png",
    "eventName": "Shivatech-2024",
    "description": "On November 16, 2024, Shivalik College of Engineering, in collaboration with USERC, organized Science Championship 3.0. The highlight of the program was the innovation and brilliance of young minds. The event had diverse participation from different reputed schools, both private and public. The projects and models based on themes of science, society, and environment proved that the next generation is so close to scientific excellence. The event hosted more than 80 schools, 180 teams, and over 800 students. With an innovative theme, the event focused on themes of Science, Society, and Environment. The event was designed to instill a deep passion for technology and broadening scientific knowledge."
  },
  {
    "id": 2,
    "img": "/ApiImage/Aimg2.png",
    "eventName": "Hackathon 2024",
    "description": "The Incubation Center of Shivalik College, CBII and iHUB Shivalik organised Hackathon 2024 with a vision to generate high-value, actionable business ideas and product concepts. The event was organised to foster a spirit of entrepreneurship among young minds. More than 300 students from 63+ teams participated in this collaborative technical event, proposing solutions to industrial and social problem statements. The event had participation from various institutes, including colleges and universities, from regions students of Uttarakhand, UP, and the NCR region. During the event, the participating teams built actionable business ideas and product concepts by working relentlessly for 30 hours."
  },
  {
    "id": 3,
    "img": "/ApiImage/Aimg3.png",
    "eventName": "Science Championship 3.0",
    "description": "On November 16, 2024, Shivalik College of Engineering, in collaboration with USERC, organized Science Championship 3.0. The highlight of the program was the innovation and brilliance of young minds. The event had diverse participation from different reputed schools, both private and public. The projects and models based on themes of science, society, and environment proved that the next generation is so close to scientific excellence. The event hosted more than 80 schools, 180 teams, and over 800 students. With an innovative theme, the event focused on themes of Science, Society, and Environment. The event was designed to instill a deep passion for technology and broadening scientific knowledge."
  }

  
]